RWU-EMM/Embedded-Project/project/ESP32S3/filter/main/main.c
#include <math.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "coeff_loader.h"
#include "digital_filters.h" /* df_handle_t, df_init(), df_process()     */
#include "dsm_packet.h"
#include "fgen_sim.h"
#include "filter_config.h" /* coefficient bank + fts_config_t          */
#include "uart_driver.h"   /* init_uart_driver(), uart_send()          */

#include "wifi_udp_handler.h"

#include "usb_cdc_acm_driver.h"

#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/task.h"
#include "soc/soc_caps.h"

#include "driver/gpio.h"
#include "driver/gptimer.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_adc/adc_oneshot.h"

#include "esp_err.h"
#include "esp_log.h"
#include "esp_timer.h"

#if (ACTIVE_SEND_MODE == SEND_MODE_UDP)
static uint8_t s_batch_buf[sizeof(dsm_batch_hdr_t) +
                           UDP_BATCH_SIZE * sizeof(dsm_packet_t)] = {0};
static uint32_t s_batch_idx = 0;
static uint32_t s_batch_id = 0;
_Static_assert(sizeof(dsm_batch_hdr_t) == 6, "batch hdr size invalid");
#endif

#define DEFAULT_SIM_AMP 100
#define DEFAULT_SIM_MODE _FGEN_SIM_IMP

gptimer_handle_t gptimer = NULL;
gptimer_config_t timer_config = {
    .clk_src = GPTIMER_CLK_SRC_DEFAULT,
    .direction = GPTIMER_COUNT_UP,
    .resolution_hz = 1000000, /* 1 tick = 1 µs */
};

/* Primary and Secondary UART Handles using your driver */
static uart_driver_handle_t s_uart_cmd;
static uart_driver_handle_t s_uart_ext;

const void *g_coeff_override = NULL;
// Build-time switches
// Set to 1 to enable per-tick period/exec-time diagnostics via ESP_LOGI.
#define ENABLE_DEBUG_LOGS 0

// Sampling-rate configuration
#define DEFAULT_FS_HZ (5000U)

static const uint32_t fs_Hz = DEFAULT_FS_HZ;
// 2 ticks required for ISR scheduling
static const uint32_t FTs_us = (1000000U / DEFAULT_FS_HZ) - 2;

// ADC
#define ADC_CHANNEL ADC_CHANNEL_4 /* matches user hardware */
#define ADC_ATTEN ADC_ATTEN_DB_12
#define ADC_BITWIDTH ADC_BITWIDTH_DEFAULT

static adc_oneshot_unit_handle_t s_adc_handle = NULL;

static void adc_init(void) {
  adc_oneshot_unit_init_cfg_t init_cfg = {
      .unit_id = ADC_UNIT_1,
  };
  ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_cfg, &s_adc_handle));

  adc_oneshot_chan_cfg_t chan_cfg = {
      .atten = ADC_ATTEN,
      .bitwidth = ADC_BITWIDTH,
  };
  ESP_ERROR_CHECK(
      adc_oneshot_config_channel(s_adc_handle, ADC_CHANNEL, &chan_cfg));
  ESP_LOGI(__func__, "ADC initialised (unit=1, ch=%d, atten=12dB)",
           ADC_CHANNEL);
}
// Digital filter handle
static df_handle_t s_filter;

static fgen_sim_t s_fgen;

/*
 * Global runtime config
 *   Declared extern in filter_config.h; defined here so the linker sees
 *   exactly one definition.
 *  */

fts_config_t g_fts_cfg = {
    .filter_pending = false,
    .input_pending = false,
    .sim_freq_pending = false,
    .next_filter = DEFAULT_FILTER_TYPE,
    .next_input = DEFAULT_INPUT_MODE,
    .next_sim_freq_hz = DEFAULT_SIM_FREQ_HZ,
    .active_filter = DEFAULT_FILTER_TYPE,
    .active_input = DEFAULT_INPUT_MODE,
    .active_sim_freq_hz = DEFAULT_SIM_FREQ_HZ,
    .timer_state = FTS_TIMER_RUNNING,
    .sim_mode_pending = false,
    .next_sim_mode = DEFAULT_SIM_MODE,
    .active_sim_mode = DEFAULT_SIM_MODE,
    .sim_amp_pending = false,
    .next_sim_amp = DEFAULT_SIM_AMP,
    .active_sim_amp = DEFAULT_SIM_AMP,
    .coeff_load_pending = false,
};

static void ext_interface_init(void) {
  /* 1. Configure CMD_GPIO as Output (Default HIGH) */
  gpio_config_t io_conf_cmd = {
      .pin_bit_mask = (1ULL << EXT_CMD_GPIO),
      .mode = GPIO_MODE_OUTPUT,
      .pull_up_en = GPIO_PULLUP_ENABLE,
      .pull_down_en = GPIO_PULLDOWN_DISABLE,
      .intr_type = GPIO_INTR_DISABLE,
  };
  gpio_config(&io_conf_cmd);
  gpio_set_level(EXT_CMD_GPIO, 1); /* Default HIGH */

  /* 2. Configure RDY_GPIO as Input (Default HIGH via pull-up) */
  gpio_config_t io_conf_rdy = {
      .pin_bit_mask = (1ULL << EXT_RDY_GPIO),
      .mode = GPIO_MODE_INPUT,
      .pull_up_en = GPIO_PULLUP_ENABLE,
      .pull_down_en = GPIO_PULLDOWN_DISABLE,
      .intr_type = GPIO_INTR_DISABLE,
  };
  gpio_config(&io_conf_rdy);

  /* 3. Initialize Secondary UART using custom driver */
  memset(&s_uart_ext, 0, sizeof(s_uart_ext));
  s_uart_ext.config = (uart_driver_config_t){
      .uart_port = UART_NUM_1,
      .baudrate = _115200,
      .data_bits = UART_DATA_8_BITS,
      .stop_bits = UART_STOP_BITS_1,
      .parity = UART_PARITY_DISABLE,
      .tx_pin = 17, /* <-- Set secondary TX pin */
      .rx_pin = 18, /* <-- Set secondary RX pin */
  };
  s_uart_ext.rx_cb = NULL; /* Forwarding only, no RX callback needed */
  ESP_ERROR_CHECK(init_uart_driver(&s_uart_ext));

  ESP_LOGI(
      __func__,
      "External interface ready (CMD: GPIO%d, RDY: GPIO%d, Secondary UART1)",
      EXT_CMD_GPIO, EXT_RDY_GPIO);
}

static void print_active_coeff(filter_type_e t) {
  switch (t) {
  case _IIR_FLOAT: {
    df_iir_float_t *f = &s_filter.state.iir_f;
    ESP_LOGI(__func__, "iirf.Nb=%d iirf.Na=%d", f->Nb, f->Na);
    for (int i = 0; i < f->Nb; i++)
      ESP_LOGI(__func__, "b[%d]=%f", i, f->b[i]);
    for (int i = 0; i < f->Na; i++)
      ESP_LOGI(__func__, "a[%d]=%f", i, f->a[i]);
    break;
  }
  case _IIR_INT: {
    df_iir_int_t *f = &s_filter.state.iir_i;
    ESP_LOGI(__func__, "iiri.Nb=%d iiri.Na=%d", f->Nb, f->Na);
    for (int i = 0; i < f->Nb; i++)
      ESP_LOGI(__func__, "Sb[%d]=%ld", i, (long)f->Sb[i]);
    for (int i = 0; i < f->Na; i++)
      ESP_LOGI(__func__, "Sa[%d]=%ld", i, (long)f->Sa[i]);
    break;
  }
  case _FIR_FLOAT: {
    df_fir_float_t *f = &s_filter.state.fir_f;
    ESP_LOGI(__func__, "firf.M=%d", f->M);
    for (int i = 0; i < f->M; i++)
      ESP_LOGI(__func__, "b[%d]=%f", i, f->b[i]);
    break;
  }
  case _FIR_INT: {
    df_fir_int_t *f = &s_filter.state.fir_i;
    ESP_LOGI(__func__, "firi.M=%d", f->M);
    for (int i = 0; i < f->M; i++)
      ESP_LOGI(__func__, "Sb[%d]=%d", i, f->Sb[i]);
    break;
  }
  case _SOS_FLOAT: {
    df_sos_float_t *f = &s_filter.state.sos_f;
    ESP_LOGI(__func__, "sosf.N=%d", f->Nsos);
    for (int i = 0; i < f->Nsos; i++) {
      df_biquad_float_t *s = &f->stage[i];
      ESP_LOGI(__func__, "sosf%d: b=%f %f %f a=1 %f %f", i, s->b[0], s->b[1],
               s->b[2], s->a[1], s->a[2]);
    }
    break;
  }
  case _SOS_INT: {
    df_sos_int_t *f = &s_filter.state.sos_i;
    ESP_LOGI(__func__, "sosi.N=%d", f->Nsos);
    for (int i = 0; i < f->Nsos; i++) {
      df_biquad_int_t *s = &f->stage[i];
      ESP_LOGI(__func__, "sosi%d: Sb=%ld %ld %ld Sa=%ld %ld %ld", i,
               (long)s->Sb[0], (long)s->Sb[1], (long)s->Sb[2], (long)s->Sa[0],
               (long)s->Sa[1], (long)s->Sa[2]);
    }
    break;
  }
  case _LTC_FLOAT: {
    df_ltc_float_t *f = &s_filter.state.ltc_f;
    ESP_LOGI(__func__, "ltcf.Nnu=%d ltcf.Nk=%d", f->Nnu, f->Nk);
    for (int i = 0; i < f->Nnu; i++)
      ESP_LOGI(__func__, "nu[%d]=%f", i, f->nu[i]);
    for (int i = 0; i < f->Nk; i++)
      ESP_LOGI(__func__, "k[%d]=%f", i, f->k[i]);
    break;
  }
  case _LTC_INT: {
    df_ltc_int_t *f = &s_filter.state.ltc_i;
    ESP_LOGI(__func__, "ltci.Nnu=%d ltci.Nk=%d", f->Nnu, f->Nk);
    for (int i = 0; i < f->Nnu; i++)
      ESP_LOGI(__func__, "Snu[%d]=%ld", i, (long)f->Snu[i]);
    for (int i = 0; i < f->Nk; i++)
      ESP_LOGI(__func__, "Sk[%d]=%ld", i, (long)f->Sk[i]);
    break;
  }
  default:
    break;
  }
}

static inline void fts_cfg_set_sim_mode(fgen_sim_mode_e m) {
  g_fts_cfg.next_sim_mode = m;
  g_fts_cfg.sim_mode_pending = true;
}

static inline void fts_cfg_set_sim_amp(int16_t a) {
  g_fts_cfg.next_sim_amp = a;
  g_fts_cfg.sim_amp_pending = true;
  ESP_LOGI(__func__, "%d", a);
}

