RWU-EMM/Embedded-Project/project/ESP32S3/filter/main/main.c
/*
 * Pending-change processor  (called once per sampling tick, before DSP work)
 *
 * The UART RX callback runs in the uart_driver's rx_task, which only touches
 * the volatile pending flags and the "next_*" fields.  This function runs in
 * the sampling task and applies them, then calls df_init() if needed.
 * No mutex required for this single-writer / single-reader pattern.
 *  */

static inline void fts_cfg_apply_pending(void) {
  bool reinit_filter = false;

  /* Handle Execution Mode change (Internal <-> External) */
  if (g_fts_cfg.exe_mode_pending) {
    g_fts_cfg.exe_mode_pending = false;
    g_fts_cfg.active_exe_mode = g_fts_cfg.next_exe_mode;

    if (g_fts_cfg.active_exe_mode == FTS_EXE_MODE_EXT) {
      /* Stop internal timer in External Mode */
      gptimer_stop(gptimer);
      g_fts_cfg.timer_state = FTS_TIMER_STOPPED;
      ESP_LOGI(__func__, "Switched to EXTERNAL Mode: GPTimer Stopped");
    } else {
      /* Restart internal timer for Internal Mode */
      gptimer_start(gptimer);
      g_fts_cfg.timer_state = FTS_TIMER_RUNNING;
      ESP_LOGI(__func__, "Switched to INTERNAL Mode: GPTimer Started");
    }
  }

  if (g_fts_cfg.sim_freq_pending) {
    g_fts_cfg.sim_freq_pending = false;
    g_fts_cfg.active_sim_freq_hz = g_fts_cfg.next_sim_freq_hz;
    fgen_sim_set_freq(&s_fgen, g_fts_cfg.active_sim_freq_hz);
    ESP_LOGI(__func__, "SIM freq -> %.1f Hz",
             (double)g_fts_cfg.active_sim_freq_hz);
  }

  if (g_fts_cfg.sim_amp_pending) {
    g_fts_cfg.sim_amp_pending = false;
    g_fts_cfg.active_sim_amp = g_fts_cfg.next_sim_amp;
    fgen_sim_set_amp(&s_fgen, g_fts_cfg.active_sim_amp);
  }

  if (g_fts_cfg.sim_mode_pending) {
    g_fts_cfg.sim_mode_pending = false;
    g_fts_cfg.active_sim_mode = g_fts_cfg.next_sim_mode;
    fgen_sim_set_mode(&s_fgen, g_fts_cfg.active_sim_mode);
  }

  if (g_fts_cfg.filter_pending) {
    g_fts_cfg.filter_pending = false;
    g_fts_cfg.active_filter = g_fts_cfg.next_filter;
    reinit_filter = true;
  }

  if (g_fts_cfg.input_pending) {
    g_fts_cfg.input_pending = false;
    g_fts_cfg.active_input = g_fts_cfg.next_input;
    reinit_filter = true; /* reset filter state on source switch */
    ESP_LOGI(__func__, "Input -> %s",
             g_fts_cfg.active_input == FTS_INPUT_ADC ? "ADC" : "SIM");
  }

  if (reinit_filter) {
    df_init(&s_filter, g_fts_cfg.active_filter,
            filter_get_coeff(g_fts_cfg.active_filter), DEFAULT_DIRECT_FORM,
            DEFAULT_QUANT_MODE);
    g_coeff_override = NULL;
    ESP_LOGI(__func__, "Filter reinit -> type %d",
             (int)g_fts_cfg.active_filter);
  }
}

/*
 * UART RX callback  (called from uart_driver's rx_task with received bytes)
 *
 * Commands (plain ASCII, newline-terminated):
 *   filter <n>       n = 0..7  (filter_type_e)
 *   input sim        switch to DDS simulation
 *   input adc        switch to real ADC
 *   freq <f>         DDS frequency in Hz
 *
 * Only writes volatile fields of g_fts_cfg and sets pending flags.
 * The sampling loop applies the changes safely between ticks.
 *  */

static fts_input_mode_e str_to_imode(const char *s) {
  return (!strcmp(s, "gpio")) ? FTS_INPUT_ADC : FTS_INPUT_SIM;
}
static int fmode_str_to_enum(const char *s) {
  static const char *names[] = {"iiri", "iirf", "firi", "firf",
                                "sosi", "sosf", "ltci", "ltcf"};
  static const filter_type_e vals[] = {_IIR_INT,   _IIR_FLOAT, _FIR_INT,
                                       _FIR_FLOAT, _SOS_INT,   _SOS_FLOAT,
                                       _LTC_INT,   _LTC_FLOAT};
  for (int i = 0; i < 8; i++)
    if (!strcmp(s, names[i]))
      return vals[i];
  return -1;
}

static void do_reset(void) {
  gptimer_stop(gptimer);
  g_fts_cfg.timer_state = FTS_TIMER_STOPPED;
  g_fts_cfg.next_filter = DEFAULT_FILTER_TYPE;
  g_fts_cfg.filter_pending = true;
  g_fts_cfg.next_input = DEFAULT_INPUT_MODE;
  g_fts_cfg.input_pending = true;
  g_fts_cfg.next_sim_freq_hz = DEFAULT_SIM_FREQ_HZ;
  g_fts_cfg.sim_freq_pending = true;
  g_fts_cfg.next_sim_amp = DEFAULT_SIM_AMP;
  g_fts_cfg.sim_amp_pending = true;
  g_fts_cfg.next_sim_mode = DEFAULT_SIM_MODE;
  g_fts_cfg.sim_mode_pending = true;
  ESP_LOGI(__func__, "RESET: filter=%d input=%d freq=%.1f amp=%d mode=%d",
           (int)DEFAULT_FILTER_TYPE, (int)DEFAULT_INPUT_MODE,
           (double)DEFAULT_SIM_FREQ_HZ, (int)DEFAULT_SIM_AMP,
           (int)DEFAULT_SIM_MODE);
}

static void forward_to_secondary_uart(const char *line) {
  /* Wait for RDY pin to go LOW */
  while (gpio_get_level(EXT_RDY_GPIO) != 0) {
    vTaskDelay(pdMS_TO_TICKS(1));
  }

  /* Drive CMD pin LOW */
  gpio_set_level(EXT_CMD_GPIO, 0);

  /* Wait a few milliseconds before starting transfer */
  vTaskDelay(pdMS_TO_TICKS(5));

  /* Forward command line with newline over secondary UART */
  uart_send(&s_uart_ext, (const uint8_t *)line, strlen(line));
  uart_send(&s_uart_ext, (const uint8_t *)"\n", 1);

  /* Wait for RDY pin to return HIGH */
  while (gpio_get_level(EXT_RDY_GPIO) != 1) {
    vTaskDelay(pdMS_TO_TICKS(1));
  }

  /* Drive CMD pin back HIGH */
  gpio_set_level(EXT_CMD_GPIO, 1);
}

static void uart_cmd_process_line(char *line) {
  // ESP_LOGI("DBGLINE", "raw len=%d line=[%s]", (int)strlen(line), line);

  char *end = line + strlen(line) - 1;
  while (end >= line && (*end == '\r' || *end == '\n')) {
    *end-- = '\0';
  }
  if (strlen(line) == 0) {
    return;
  }

  /* Handle Mode Switching Commands */
  if (!strcmp(line, "exemode:int")) {
    g_fts_cfg.next_exe_mode = FTS_EXE_MODE_INT;
    g_fts_cfg.exe_mode_pending = true;
    ESP_LOGI(__func__, "Mode -> INTERNAL");
    return;
  } else if (!strcmp(line, "exemode:ext")) {
    g_fts_cfg.next_exe_mode = FTS_EXE_MODE_EXT;
    g_fts_cfg.exe_mode_pending = true;
    ESP_LOGI(__func__, "Mode -> EXTERNAL");
    return;
  }

  // If EXTERNAL mode, ALSO forward the command :
  if (g_fts_cfg.active_exe_mode == FTS_EXE_MODE_EXT) {
    forward_to_secondary_uart(line);
  }

  /* coeff-load passthrough mode */
  if (g_fts_cfg.coeff_load_pending) {
    ESP_LOGI("DBGLINE", "stripped len=%d line=[%s]", (int)strlen(line), line);
    coeff_loader_feed_line(line);
    coeff_load_state_e st = coeff_loader_state();
    if (st == CL_DONE_OK) {
      filter_type_e t;
      const void *c;
      if (coeff_loader_commit(&t, &c)) {
        g_coeff_override = c;
        g_fts_cfg.next_filter = t;
        g_fts_cfg.filter_pending = true;
        ESP_LOGI(__func__, "COEFF: load OK, type=%d", (int)t);
        gptimer_start(gptimer);
        g_fts_cfg.timer_state = FTS_TIMER_RUNNING;
      } else {
        ESP_LOGW(__func__, "COEFF: validation FAILED, restoring defaults");
        /* full reset, same as "rest" command */
        do_reset();
      }
      g_fts_cfg.coeff_load_pending = false;
      // return; /* skip the unconditional timer_pending block below */
    }
    return;
  }

  if (!strcmp(line, "reset")) {
    coeff_loader_abort();
    g_fts_cfg.coeff_load_pending = false;
    do_reset();
  } else if (!strcmp(line, "ar")) {
    esp_restart();
  } else if (!strcmp(line, "stop")) {
    gptimer_stop(gptimer);
    g_fts_cfg.timer_state = FTS_TIMER_STOPPED;
  } else if (!strcmp(line, "start")) {
    gptimer_start(gptimer);
    g_fts_cfg.timer_state = FTS_TIMER_RUNNING;
  } else if (!strncmp(line, "imode:", 6))
    fts_cfg_set_input(str_to_imode(line + 6));
  else if (!strncmp(line, "freq:", 5))
    fts_cfg_set_sim_freq(strtof(line + 5, NULL));
  else if (!strncmp(line, "amp:", 4))
    fts_cfg_set_sim_amp((int16_t)atoi(line + 4));
  else if (!strncmp(line, "fmode:", 6)) {
    int t = fmode_str_to_enum(line + 6);
    if (t >= 0)
      fts_cfg_set_filter((filter_type_e)t);
    else
      ESP_LOGW(__func__, "CMD: Wrong fmode '%s'", line + 6);
  } else if (!strcmp(line, "gcoeff")) {
    print_active_coeff(
        g_fts_cfg.active_filter); /* implement: dump struct via ESP_LOGI */
  } else if (!strncmp(line, "scoeff:", 7)) {
    int t = fmode_str_to_enum(line + 7);
    if (t >= 0) {
      gptimer_stop(gptimer);
      g_fts_cfg.timer_state = FTS_TIMER_STOPPED;

      coeff_loader_begin((filter_type_e)t);
      g_fts_cfg.coeff_load_pending = true;
      ESP_LOGI(__func__, "COEFF: waiting for utx, type=%d", t);
    } else
      ESP_LOGW(__func__, "CMD: Wrong fmode '%s'", line + 7);
  } else if (!strcmp(line, "wave:sin")) {
    fts_cfg_set_sim_mode(_FGEN_SIM_SIN);
  } else if (!strcmp(line, "wave:imp")) {
    fts_cfg_set_sim_mode(_FGEN_SIM_IMP);
  } else {
    ESP_LOGW(__func__, "CMD: unknown '%s'", line);
  }
}

// static void uart_cmd_rx_cb(uint8_t *data, uint16_t len)
// {
//     (void)len;
//     char *buf = (char *)data;

//     char *line = strtok(buf, "\n");
//     while (line != NULL)
//     {
//         uart_cmd_process_line(line);
//         line = strtok(NULL, "\n");
//     }
// }

