RWU-EMM/Embedded-Project/project/ESP32S3/filter/main/main.c
#define RX_LINE_BUFFER_SIZE 4096

static char rx_accum[RX_LINE_BUFFER_SIZE];
static size_t rx_used = 0;

static void uart_cmd_rx_cb(uint8_t *data, uint16_t len) {
  if (rx_used + len >= RX_LINE_BUFFER_SIZE) {
    ESP_LOGE("UART", "RX accumulation overflow");
    rx_used = 0;
    return;
  }

  memcpy(rx_accum + rx_used, data, len);
  rx_used += len;

  while (1) {
    char *newline = memchr(rx_accum, '\n', rx_used);

    if (!newline)
      break;

    size_t line_len = newline - rx_accum;

    *newline = '\0';

    uart_cmd_process_line(rx_accum);

    size_t remaining = rx_used - (line_len + 1);

    memmove(rx_accum, newline + 1, remaining);

    rx_used = remaining;
  }
}

/*
 * DSM packet state
 *  */

static dsm_packet_t s_dsm_pkt;
static int16_t s_seq = 0;

_Static_assert(sizeof(dsm_packet_t) == DSM_PACKET_SIZE_BYTES,
               "DSM size invalid");

/*
 * Timer ISR
 *  */

static TaskHandle_t s_fts_task = NULL;

static bool IRAM_ATTR timer_on_alarm_cb(gptimer_handle_t timer,
                                        const gptimer_alarm_event_data_t *edata,
                                        void *user_ctx) {
  (void)timer;
  (void)edata;
  (void)user_ctx;
  BaseType_t high_task_awoken = pdFALSE;
  vTaskNotifyGiveFromISR(s_fts_task, &high_task_awoken);
  return (high_task_awoken == pdTRUE);
}

/*
 * app_main
 *  */

void app_main(void) {
  memset(&s_dsm_pkt, 0, sizeof(s_dsm_pkt));
  s_dsm_pkt.sig = DSM_SIGNATURE;

  s_fts_task = xTaskGetCurrentTaskHandle();

  // UDP Init

#if (ACTIVE_SEND_MODE == SEND_MODE_UDP)
  wifi_udp_handler_config_t wifi_udp_handler_config = {
      .target_ip = "192.168.0.158",
      // .target_ip = "10.17.36.16",
      .target_port = 2812,
  };
  wifi_udp_handler_init(&wifi_udp_handler_config);
#endif

#if (ACTIVE_SEND_MODE == SEND_MODE_USB)
  // USB CDC
  usb_cdc_driver_config_t usb_cfg = {
      .enable_port_0 = true,
      .enable_port_1 = false,
  };
  ESP_ERROR_CHECK(usb_cdc_driver_init(&usb_cfg));
#endif

  // ADC(always init so it is ready when "input adc" is commanded)
  adc_init();

  // UART command interface(uses your uart_driver component) * UART1, 115200 -
  // 8N1, GPIO 17 TX / 18 RX  – adjust pins as needed

  memset(&s_uart_cmd, 0, sizeof(s_uart_cmd));

  s_uart_cmd.config = (uart_driver_config_t){
      .uart_port = UART_NUM_0,
      .baudrate = _115200,
      .data_bits = UART_DATA_8_BITS,
      .stop_bits = UART_STOP_BITS_1,
      .parity = UART_PARITY_DISABLE,
      .tx_pin = -1, /* <-- adjust to your board */
      .rx_pin = -1, /* <-- adjust to your board */
  };
  s_uart_cmd.rx_cb = uart_cmd_rx_cb;
  ESP_ERROR_CHECK(init_uart_driver(&s_uart_cmd));
  ESP_LOGI(__func__, "UART command interface ready (UART%d, 115200-8N1)",
           s_uart_cmd.config.uart_port);

  ext_interface_init();

  // Digital filter(initial type and coefficients from filter_config.h)

  df_init(&s_filter, DEFAULT_FILTER_TYPE, filter_get_coeff(DEFAULT_FILTER_TYPE),
          DEFAULT_DIRECT_FORM, DEFAULT_QUANT_MODE);

  ESP_LOGI(__func__, "Boot: filter type=%d  input=%s  sim_freq=%.1f Hz",
           (int)DEFAULT_FILTER_TYPE,
           DEFAULT_INPUT_MODE == FTS_INPUT_ADC ? "ADC" : "SIM",
           (double)DEFAULT_SIM_FREQ_HZ);

  // GP timer(fires every Ts = 1 / Fs)

  ESP_ERROR_CHECK(gptimer_new_timer(&timer_config, &gptimer));

  gptimer_alarm_config_t alarm_config = {
      .reload_count = 0,
      .alarm_count = FTs_us,
      .flags.auto_reload_on_alarm = true,
  };
  ESP_ERROR_CHECK(gptimer_set_alarm_action(gptimer, &alarm_config));

  gptimer_event_callbacks_t cbs = {.on_alarm = timer_on_alarm_cb};
  ESP_ERROR_CHECK(gptimer_register_event_callbacks(gptimer, &cbs, NULL));
  ESP_ERROR_CHECK(gptimer_enable(gptimer));
  ESP_ERROR_CHECK(gptimer_start(gptimer));

  // Sampling loop

#if (ENABLE_DEBUG_LOGS == 1)
  static int64_t last_t = 0;
  static int64_t period_sum = 0;
  static int64_t exec_sum = 0;
  static uint32_t cnt = 0;
#endif

  fgen_sim_init(&s_fgen, fs_Hz);
  fgen_sim_set_amp(&s_fgen, g_fts_cfg.active_sim_amp);
  fgen_sim_set_mode(&s_fgen, g_fts_cfg.active_sim_mode);
  fgen_sim_set_freq(&s_fgen, DEFAULT_SIM_FREQ_HZ);

  while (1) {
    /* Apply any pending runtime configuration changes */
    fts_cfg_apply_pending();
    bool data_ready = false;

    int16_t adc_raw = 0;
    int16_t filt_y = 0;
    int64_t dt_us = 0;

#if (ENABLE_DEBUG_LOGS == 1)
    int64_t now = esp_timer_get_time();
    if (last_t != 0)
      period_sum += (now - last_t);
    last_t = now;

#endif
    // INTERNAL MODE: Standard GPTimer-driven local DSP
    if (g_fts_cfg.active_exe_mode == FTS_EXE_MODE_INT) {

      /* Block until the timer ISR fires (every Ts = 1/Fs) */
      ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
      int64_t t1 = esp_timer_get_time();

      if (g_fts_cfg.active_input == FTS_INPUT_ADC) {
        int raw = 0;
        adc_oneshot_read(s_adc_handle, ADC_CHANNEL, &raw);
        adc_raw = (int16_t)(raw - 2048);
      } else {
        adc_raw = fgen_sim_tic(&s_fgen, NULL);
      }

      filt_y = df_process(&s_filter, adc_raw);

      s_dsm_pkt.adc_in = adc_raw;
      s_dsm_pkt.fgen_out = adc_raw;
      s_dsm_pkt.filt_x = adc_raw;
      s_dsm_pkt.filt_y = filt_y;
      s_dsm_pkt.dac0 = (int16_t)(adc_raw + 2048);
      s_dsm_pkt.dac1 = (int16_t)(filt_y + 2048);

      dt_us = esp_timer_get_time() - t1;
      data_ready = true; /* Mark sample ready for dispatch */
    } else {             // EXTERNAL MODE: RDY handshake + ADC_X / ADC_Y read
      /* 1. Wait for RDY pin to transition LOW */
      while (gpio_get_level(EXT_RDY_GPIO) != 0) {
        vTaskDelay(pdMS_TO_TICKS(1));
      }

      /* 2. Record low timestamp */
      int64_t t_rdy_low = esp_timer_get_time();

      /* 3. Read both analog input channels (ADC_X and ADC_Y) */
      int raw_x = 0, raw_y = 0;
      adc_oneshot_read(s_adc_handle, ADC_CHANNEL_4, &raw_x); /* ADC_X */
      adc_oneshot_read(s_adc_handle, ADC_CHANNEL_5, &raw_y); /* ADC_Y */

      adc_raw = (int16_t)(raw_x - 2048);
      filt_y = (int16_t)(raw_y - 2048);

      /* 4. Wait for RDY pin to transition back HIGH */
      while (gpio_get_level(EXT_RDY_GPIO) != 1) {
        vTaskDelay(pdMS_TO_TICKS(1));
      }

      /* 5. Record high timestamp and compute time difference */
      int64_t t_rdy_high = esp_timer_get_time();
      dt_us = t_rdy_high - t_rdy_low;

      data_ready = true; /* Mark sample ready for dispatch */

