RWU-EMM/Embedded-Project/project/ESP32S3/filter/main/main.c
      /* Populate DSM packet */
      s_dsm_pkt.adc_in = adc_raw;
      s_dsm_pkt.fgen_out = adc_raw;
      s_dsm_pkt.filt_x = adc_raw;
      s_dsm_pkt.filt_y = filt_y; /* Assigned directly from ADC_Y */
      s_dsm_pkt.dac0 = (int16_t)(adc_raw + 2048);
      s_dsm_pkt.dac1 = (int16_t)(filt_y + 2048);
    }

    // UNIFIED DISPATCH PIPELINE (Runs once data_ready == true)
    if (data_ready) {
      /* Frame Packet Data */
      s_dsm_pkt.n = (uint8_t)(((DSM_PACKET_SIZE_BYTES) & 0x3F) |
                              (((s_seq++) & 0x3) << 6));
      s_dsm_pkt.adc_in = adc_raw;
      s_dsm_pkt.fgen_out = adc_raw;
      s_dsm_pkt.filt_x = adc_raw;
      s_dsm_pkt.filt_y = filt_y;
      s_dsm_pkt.dac0 = (int16_t)(adc_raw + 2048);
      s_dsm_pkt.dac1 = (int16_t)(filt_y + 2048);
      s_dsm_pkt.dt = (int16_t)dt_us;
      s_dsm_pkt.crc16 = dsm_calc_xor16((const uint8_t *)&s_dsm_pkt.sig,
                                       DSM_PACKET_SIZE_BYTES - 2);

#if (ACTIVE_SEND_MODE == SEND_MODE_USB)
      if (usb_cdc_is_connected(USB_CDC_PORT_0)) {
        usb_cdc_write(USB_CDC_PORT_0, (const uint8_t *)&s_dsm_pkt,
                      sizeof(s_dsm_pkt));
      }
#endif

#if (ACTIVE_SEND_MODE == SEND_MODE_UDP)
      memcpy(s_batch_buf + sizeof(dsm_batch_hdr_t) +
                 (s_batch_idx * sizeof(dsm_packet_t)),
             &s_dsm_pkt, sizeof(dsm_packet_t));

      s_batch_idx++;

      if (s_batch_idx == UDP_BATCH_SIZE) {
        dsm_batch_hdr_t hdr;
        hdr.batch_id = s_batch_id++;
        hdr.count = UDP_BATCH_SIZE;
        memcpy(s_batch_buf, &hdr, sizeof(hdr));

        wifi_udp_handler_send(s_batch_buf, sizeof(s_batch_buf));
        s_batch_idx = 0;
      }
#endif
    }
  }

  // DIAGNOSTICS  (compiled out when ENABLE_DEBUG_LOGS == 0)
#if (ENABLE_DEBUG_LOGS == 1)
  exec_sum += (esp_timer_get_time() - t1);
  cnt++;
  if (cnt >= 100) {
    ESP_LOGI(
        __func__, "avg_period=%lld us  avg_exec=%lld us  filt=%d  input=%s",
        period_sum / (cnt - 1), exec_sum / cnt, (int)g_fts_cfg.active_filter,
        g_fts_cfg.active_input == FTS_INPUT_ADC ? "ADC" : "SIM");
    cnt = period_sum = exec_sum = 0;
  }
#endif
}
